{"index":{"_id":1}}
{"title":"Fast and Easy Pasta With Blistered Cherry Tomato Sauce","description":"Cherry tomatoes are almost always sweeter, riper, and higher in pectin than larger tomatoes at the supermarket. All of these factors mean that cherry tomatoes are fantastic for making a rich, thick, flavorful sauce. Even better: It takes only four ingredients and about 10 minutes, start to finish—less time than it takes to cook the pasta you're gonna serve it with.","preparation_time_minutes":12,"servings":{"min":4,"max":6},"steps":["Place pasta in a large skillet or sauté pan and cover with water and a big pinch of salt. Bring to a boil over high heat, stirring occasionally. Boil until just shy of al dente, about 1 minute less than the package instructions recommend.","Meanwhile, heat garlic and 4 tablespoons (60ml) olive oil in a 12-inch skillet over medium heat, stirring frequently, until garlic is softened but not browned, about 3 minutes. Add tomatoes and cook, stirring, until tomatoes begin to burst. You can help them along by pressing on them with the back of a wooden spoon as they soften.","Continue to cook until sauce is rich and creamy, about 5 minutes longer. Stir in basil and season to taste with salt and pepper.","When pasta is cooked, drain, reserving 1 cup of pasta water. Add pasta to sauce and increase heat to medium-high. Cook, stirring and tossing constantly and adding reserved pasta water as necessary to adjust consistency to a nice, creamy flow. Remove from heat, stir in remaining 2 tablespoons (30ml) olive oil, and grate in a generous shower of Parmesan cheese. Serve immediately, passing extra Parmesan at the table."],"ingredients":[{"name":"Dry pasta","quantity":"450g"},{"name":"Kosher salt"},{"name":"Cloves garlic","quantity":"4"},{"name":"Extra-virgin olive oil","quantity":"90ml"},{"name":"Cherry tomatoes","quantity":"750g"},{"name":"Fresh basil leaves","quantity":"30g"},{"name":"Freshly ground black pepper"},{"name":"Parmesan cheese"}],"created":"2017\/03\/29","ratings":[4.5,5.0,3.0,4.5]}
{"index":{"_id":2}}
{"title":"Pasta With Butternut Squash and Sage Brown Butter","description":"Brown butter-based pasta sauces are some of the simplest things around. They're emulsions made with a flavorful fat and pasta cooking water that coats the pasta in a thin, creamy sheen of flavor. Throw in some sautéed squash and some sage and you've got yourself a great 30-minute meal. It's a classic fall and winter dish that can be made right on the stovetop.","preparation_time_minutes":30,"servings":{"min":4,"max":6},"steps":["Heat olive oil in a large stainless steel or cast-iron skillet over high heat until very lightly smoking. Immediately add squash, season with salt and pepper, and cook, stirring and tossing occasionally, until well-browned and squash is tender, about 5 minutes. Add butter and shallots and continue cooking, stirring frequently, until butter is lightly browned and smells nutty, about 1 minute longer. Add sage and stir to combine (sage should crackle and let off a great aroma). Remove from heat and stir in lemon juice. Set aside.","In a medium saucepan, combine pasta with enough room temperature or hot water to cover by about 2 inches. Season with salt. Set over high heat and bring to a boil while stirring frequently. Cook, stirring frequently, until pasta is just shy of al dente, about 2 minutes less than the package directions. Drain pasta, reserving a couple cups of the starchy cooking liquid.","Add pasta to skillet with squash along with a splash of pasta water. Bring to a simmer over high heat and cook until the pasta is perfectly al dente, stirring and tossing constantly and adding a splash of water as needed to keep the sauce loose and shiny. Off heat, stir in Parmigiano-Reggiano. Adjust seasoning with salt and pepper and texture with more pasta water as needed. Serve immediately, topped with more cheese at the table."],"ingredients":[{"name":"extra-virgin olive oil","quantity":"30ml"},{"name":"Butternut squash","quantity":"450g"},{"name":"Kosher salt"},{"name":"Freshly ground black pepper"},{"name":"Unsalted butter","quantity":"30g"},{"name":"Shallot","quantity":"1"},{"name":"Fresh sage leaves","quantity":"15g"},{"name":"Lemon juice","quantity":"15ml"},{"name":"Penne","quantity":"450g"},{"name":"Grated fresh Parmigiano-Reggiano cheese","quantity":"30g"}],"created":"2014\/12\/19","ratings":[3.0,4.0,3.5,2.0]}
{"index":{"_id":3}}
{"title":"Ricotta Gnocchi With Asparagus and Prosciutto","description":"Fresh ricotta gnocchi may be the fastest fresh-pasta recipe I know. With a little practice, I've gotten it down to under ten minutes (8 minutes 53 seconds, to be precise). But the great part about this recipe is that it serves as a suitable base for a huge variety of sauces and flavors. For instance, last week a friend of mine brought over some delicious first-of-the-season fresh asparagus which we combined with prosciutto and an easy cream sauce to make a delicious impromptu (and fast!) meal on the spot.","preparation_time_minutes":20,"servings":{"min":3,"max":4},"steps":["Set a large pot of salted water over high heat. Meanwhile, heat olive oil in a large skillet or slope-sided saucepan over medium-high heat until shimmering. Add prosciutto and cook, stirring, until mostly crisp, about 2 minutes. Add scallions and garlic and cook, stirring, until fragrant, about 1 minute. Add asparagus and cook, tossing and stirring frequently, until asparagus is just starting to turn tender, about 2 minutes.","Add heavy cream and half of Parmesan. Cook, stirring, until cream thickens and coats the asparagus pieces, about 4 minutes. Season to taste with salt and pepper.","Add gnocchi to now-boiling pot of water, stir gently, and cook until gnocchi float for 30 seconds, about 3 minutes total. Drain gnocchi, reserving 1\/4 cup of pasta cooking water. Add gnocchi, lemon juice, half of lemon zest, chives, and 2 tablespoons of cooking water to saucepan with sauce and bring to a hard boil, stirring gently. Add more pasta water to thin sauce to desired consistency. Serve immediately, topped with lemon zest and additional Parmesan cheese."],"ingredients":[{"name":"Extra-virgin olive oil","quantity":"1 tablespoon"},{"name":"Thinly sliced prosciutto","quantity":"115g"},{"name":"Thinly sliced green garlic","quantity":"1\/4 cup"},{"name":"Cloves garlic","quantity":"2"},{"name":"Asparagus","quantity":"450g"},{"name":"Heavy cream","quantity":"1 cup"},{"name":"Grated Parmigiano-Reggiano cheese","quantity":"55g"},{"name":"Kosher salt"},{"name":"Freshly ground black pepper"},{"name":"Lemon juice","quantity":"1 tablespoon"},{"name":"grated zest","quantity":"1 teaspoon"},{"name":"Minced fresh chives","quantity":"2 tablespoons"},{"name":"Ricotta"}],"created":"2007\/01\/23","ratings":[5.0]}
